Revit 2027 API
ConceptualConstructionType.GetShadeConstructionType Method
 Get a Shade ConceptualConstructionType by its ConceptualConstructionShadeType.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetShadeConstructionType(
	Document ccda,
	ConceptualConstructionShadeType typeEnum
)
Public Shared Function GetShadeConstructionType (
	ccda As Document,
	typeEnum As ConceptualConstructionShadeType
) As ElementId
public:
static ElementId^ GetShadeConstructionType(
	Document^ ccda,
	ConceptualConstructionShadeType typeEnum
)
static member GetShadeConstructionType :
        ccda : Document *
        typeEnum : ConceptualConstructionShadeType -> ElementId
Parameters
ccda Document
 The Document.
typeEnum ConceptualConstructionShadeType
 The ConceptualConstructionShadeType to get the ConceptualConstructionType for.
Return Value
ElementId
 Returns ElementId of a ConceptualConstructionType.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The enum is invalid for ConceptualConstructionShadeType. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace